inceptor-101/TYPE2_AC_CHARGER/f280013x_adc2.c
//###########################################################################
//
// FILE:    f280013x_adc.c
//
// TITLE:   F28002x ADC Support Functions.
//
//###########################################################################
//
//
// $Copyright:
// Copyright (C) 2022 Texas Instruments Incorporated - http://www.ti.com/
//
// Redistribution and use in source and binary forms, with or without 
// modification, are permitted provided that the following conditions 
// are met:
// 
//   Redistributions of source code must retain the above copyright 
//   notice, this list of conditions and the following disclaimer.
// 
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the 
//   documentation and/or other materials provided with the   
//   distribution.
// 
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
// 
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// $
//###########################################################################

//
// Included Files
//
#include <GTSI_1Phase1MPPT.h>                        // Main include file
#include "f280013x_device.h"      // Header File Include File
#include "f280013x_examples.h"    // Examples Include File
#include "f28x_project.h"
//
// SetVREF - Set Vref mode. Function to select reference mode and offset trim.
// Offset trim for Internal VREF 3.3 is unique.  All other modes use the same
// offset trim. Also note that when the mode parameter is ADC_EXTERNAL, the
// ref parameter has no effect.
//
// In this device, the bandgaps are common for all the ADC instances,
// hence common Vref configuration needs to be done for all the ADCs. This
// API configures same Vref configuration for all the supported ADCs in the
// device.
//
void SetVREF(int module, int mode, int ref)
{
    Uint16 *offset, offsetShiftVal;

    if((mode == ADC_INTERNAL) && (ref == ADC_VREF3P3))
    {
        offsetShiftVal = 8U;         // Internal / 1.65v mode offset
    }
    else
    {
        offsetShiftVal = 0U;        // All other modes
    }

    //
    // Set up pointer to offset trim in OTP for ADCA.
    //
    offset = (Uint16 *)((Uint32)0x7016CU);

    EALLOW;

    //
    // Get offset trim from OTP and write it to the register for ADCA.
    //
    AdcaRegs.ADCOFFTRIM.bit.OFFTRIM = (*offset >> offsetShiftVal) & 0xFFU;

    //
    // Set up pointer to offset trim in OTP for ADCC.
    //
    offset = (Uint16 *)((Uint32)0x7016EU);

    //
    // Get offset trim from OTP and write it to the register for ADCC.
    //
    AdccRegs.ADCOFFTRIM.bit.OFFTRIM = (*offset >> offsetShiftVal) & 0xFFU;

    //
    // Configure the reference mode for all ADCs (internal or external).
    //
    AnalogSubsysRegs.ANAREFCTL.bit.ANAREFSEL = mode;

    //
    // Configure the reference voltage for all ADCs (3.3V or 2.5V).
    //
    AnalogSubsysRegs.ANAREFCTL.bit.ANAREF2P5SEL = ref;

    EDIS;
}

//--------------FOR THE BATTERY CHARGER PROJECT--------------------

void MyInitADC2(void){

//    IN THE CODE WE ARE CONFIGURING THE ADCA AS THE MASTER AND THE ADCC AS THE SLAVE
//    WHICH MEANS THAT THE INTERRUPT WILL BE GENERATED AT THE END OF THE LOWEST PRIPRITY SOC OF THE ADCA INSTEAD OF THE ADCC
    count++;
    asm(" EALLOW");

//    RESTARTING THE ADC MODULES BOTH THE ADCA AND ADCC
    DevCfgRegs.SOFTPRES13.bit.ADC_A = 1;    // RESETTING THE ADCA MODULE
    DevCfgRegs.SOFTPRES13.bit.ADC_A = 0;    // RELEASED FROM THE RESET

    DevCfgRegs.SOFTPRES13.bit.ADC_C = 1;     // RESETTING THE ADCC MODULE
    DevCfgRegs.SOFTPRES13.bit.ADC_C = 0;    // RELEASING FROM THE RESET

    //    CONFIGURING THE ADCA FOR THE INTERVAL OF THE INTERRUPT GENERATION WHETHER AT THE START OF THE CONVERSION OR THE END OF THE CONVERSION
    AdcaRegs.ADCCTL1.all = 0x0004;   // USING THIS THE INTERRUPT WILL OCCUR AT THE END OF THE CONVERSION AND WE HAVE ALL DATA
    AdccRegs.ADCCTL1.all = 0x0004;   // CONFIGURING FOR THE C ALSO ALTHOUGH WE DONT ACTUALLY NEED IT AS THE INTERRUPT WILL BE GENERATED AT THE END OF THE ADCA INTERRUPT OR THE MASTER ADC MODULE

//    WE WANT TO USE HERE THE 60MHZ ADC CLOCK SO WE CAN CONFIGURE THEM INDIVIDUALLY IN THE A AND C MODULES
    AdcaRegs.ADCCTL2.all = 0x0006;  // AS WE KNOW THAT THE SYSCLK IS 120MHz SO THE RESULTING ADC CLOCK WILL BE 120/4 MHz = 30MHZ
    AdccRegs.ADCCTL2.all = 0x0006;  // REPEATING THE SAME THING FOR THE ADC C MODULE

//    ALTHOUGH WE CAN USE THE BURST MODE BECAUSE WE ARE USING CURRENTLY RELYING ON THE NORMAL SOC FOR OUR MANIPULATIONS
    AdcaRegs.ADCBURSTCTL.all = 0x0000;  // DEACTIVATING THE BURST MODE FOR THE ADCA SUBMODULE
    AdccRegs.ADCBURSTCTL.all = 0x0000;  // DEACTIVATING THE BURST MODE FOR THE ADCD SUBMODULE

    asm(" EDIS");

//    SETTING THE REFERENCE VOLTAGES FOR THE ADC MODULE
    SetVREF(ADC_ADCA, ADC_INTERNAL, ADC_VREF3P3);   //SETTING THE INTERNAL REFERENCE OF 3.3V FOR THE ADCA MODULE
    SetVREF(ADC_ADCC, ADC_INTERNAL, ADC_VREF3P3);   //SETTING THE INTERNAL REFERENCE OF 3.3V FOR THE ADCA MODULE

//      THE SOC FOR THE TRIGGERING IS PROVIDED BY THE SOCA OF THE EPM7(GPIO 12) OF THE DSP --- DONE

