inceptor-101/TYPE2_AC_CHARGER/f280013x_adc2.c
      asm("EALLOW");

//      WE ARE USING THE ROUND ROBIN THE SOC0 WILL BE CONFIGURED FIRST THEN THE SOC1................THEN SOC3

//      CONFIGURATION OF THE ADCA SOCS
      AdcaRegs.ADCSOC0CTL.bit.TRIGSEL = 0x11;   //THE SOC0 OF THE ADCA REGISTER WILL BE TRIGGERED BY THE SOCA OF THE EPWM7
      AdcaRegs.ADCSOC0CTL.bit.CHSEL = 0x2;      //WE ARE CONGIGURING THE CHSEL AS A2 WHERE THE CONVERSION WILL START
      AdcaRegs.ADCSOC0CTL.bit.ACQPS = 0x0B;     //KEEPING THE TIME FOR THE CAPACITOR TO CHARGE AS (11+1)*SYSCLK

      AdcaRegs.ADCSOC1CTL.bit.TRIGSEL = 0x11;   //THE SOC1 OF THE ADCA REGISTER WILL BE TRIGGERED BY THE SOCA OF THE EPWM7
      AdcaRegs.ADCSOC1CTL.bit.CHSEL = 0x3;      //WE ARE CONGIGURING THE CHSEL AS A3 WHERE THE CONVERSION WILL START
      AdcaRegs.ADCSOC1CTL.bit.ACQPS = 0x0B;     //KEEPING THE TIME FOR THE CAPACITOR TO CHARGE AS (11+1)*SYSCLK

      AdcaRegs.ADCSOC2CTL.bit.TRIGSEL = 0x11;   //THE SOC2 OF THE ADCA REGISTER WILL BE TRIGGERED BY THE SOCA OF THE EPWM7
      AdcaRegs.ADCSOC2CTL.bit.CHSEL = 0x15;      //WE ARE CONGIGURING THE CHSEL AS A15 WHERE THE CONVERSION WILL START
      AdcaRegs.ADCSOC2CTL.bit.ACQPS = 0x0B;     //KEEPING THE TIME FOR THE CAPACITOR TO CHARGE AS (11+1)*SYSCLK

      AdcaRegs.ADCSOC3CTL.bit.TRIGSEL = 0x11;   //THE SOC3 OF THE ADCA REGISTER WILL BE TRIGGERED BY THE SOCA OF THE EPWM7
      AdcaRegs.ADCSOC3CTL.bit.CHSEL = 0x1;      //WE ARE CONGIGURING THE CHSEL AS A1 WHERE THE CONVERSION WILL START
      AdcaRegs.ADCSOC3CTL.bit.ACQPS = 0x0B;     //KEEPING THE TIME FOR THE CAPACITOR TO CHARGE AS (11+1)*SYSCLK

//      CONFIGURATION OF THE ADCC SOCS
      AdccRegs.ADCSOC0CTL.bit.TRIGSEL = 0x11;   //THE SOC0 OF THE ADCC REGISTER WILL BE TRIGGERED BY THE SOCA OF THE EPWM7
      AdccRegs.ADCSOC0CTL.bit.CHSEL = 0x3;      //WE ARE COFIGURING THE CHSEL AS C3 WHERE THE CONVERSION WILL START
      AdccRegs.ADCSOC0CTL.bit.ACQPS = 0x0B;     //KEEPING THE TIME FOR THE CAPACITOR TO CHARGE AS (11+1)*SYSCLK WHERE SYSCLK = ((1/12) * 1E-7)

      AdccRegs.ADCSOC1CTL.bit.TRIGSEL = 0x11;   //THE SOC1 OF THE ADCC REGISTER WILL BE TRIGGERED BY THE SOCA OF THE EPWM7
      AdccRegs.ADCSOC1CTL.bit.CHSEL = 0x6;      //WE ARE COFIGURING THE CHSEL AS C6 WHERE THE CONVERSION WILL START
      AdccRegs.ADCSOC1CTL.bit.ACQPS = 0x0B;     //KEEPING THE TIME FOR THE CAPACITOR TO CHARGE AS (11+1)*SYSCLK WHERE SYSCLK = ((1/12) * 1E-7)

      AdccRegs.ADCSOC2CTL.bit.TRIGSEL = 0x11;   //THE SOC2 OF THE ADCC REGISTER WILL BE TRIGGERED BY THE SOCA OF THE EPWM7
      AdccRegs.ADCSOC2CTL.bit.CHSEL = 0x0;      //WE ARE COFIGURING THE CHSEL AS C0 WHERE THE CONVERSION WILL START
      AdccRegs.ADCSOC2CTL.bit.ACQPS = 0x0B;     //KEEPING THE TIME FOR THE CAPACITOR TO CHARGE AS (11+1)*SYSCLK WHERE SYSCLK = ((1/12) * 1E-7)

      // ################################################################################################
      // --------------------------------   SOC Priority Selection   ------------------------------------
      // ################################################################################################

      //----- WE WANT TO CALL INTERRUPT AT THE END OF THE CONVERSION OF THE SOC3 WHICH IF OF THE LEAST PRIORITY AND LAST TO CONVERT -----

      AdcaRegs.ADCINTSEL1N2.bit.INT1CONT      = 1;     // WE WANT THE CONTINUOUS PULSES WHETHER THE FLAG IS CLEARED OR NOT
      AdcaRegs.ADCINTSEL1N2.bit.INT1E         = 1;     // WE WANT THE INTERRUPT AT OUT INT1 OF THE ADCA_ISR
      AdcaRegs.ADCINTSEL1N2.bit.INT1SEL       = 3;   // EOC3 WILL TRIGGER THE INTERRUPT AT THE END OF CONVERSION ITS SAMPLING

      AdccRegs.ADCINTSEL1N2.bit.INT1E         = 0;     // ADC C interrupt disable

// ################################################################################################
// ----------------------------------------   Power UP the ADCs --------------------------------
// ################################################################################################

    // POWERING UP THE ADCS FOR THE CONFIGURATION

    AdcaRegs.ADCCTL1.bit.ADCPWDNZ           = 1;          // Power up the ADC A
    AdccRegs.ADCCTL1.bit.ADCPWDNZ           = 1;          // Power up the ADC C

    //******** Waiting Period after Power-Up the ADCs : START *******

    DELAY_US(1000);                              // Wait 1 ms after power-up before using the ADC

    //******** Waiting Period after Power-Up the ADCs : END *******

      asm("EDIS");
}

//----------------END OF THE ADC CODE FOR THE PROJECT----------------



void initADC(void)
{

    asm(" EALLOW");                     // Enable EALLOW protected register access

// ################################################################################################
// --------------------------------   Resetting ADCs - A and C  -----------------------------------
// ################################################################################################

    //******* Resetting the ADCs A, C: START *******

    DevCfgRegs.SOFTPRES13.bit.ADC_A         = 1;    // ADC A is reset
    DevCfgRegs.SOFTPRES13.bit.ADC_A         = 0;    // ADC A is released from reset

    DevCfgRegs.SOFTPRES13.bit.ADC_C         = 1;    // ADC C is reset
    DevCfgRegs.SOFTPRES13.bit.ADC_C         = 0;    // ADC C is released from reset


    //******** Resetting the ADCs A, C: END ********

// ################################################################################################
// ----------------------------    Configure the ADC base register  -------------------------------
// ################################################################################################

    // ------ Configuring ADC A, ADC C Control-1 Register: START -------

    AdcaRegs.ADCCTL1.all                    = 0x0004;      // Main ADC A configuration
    AdccRegs.ADCCTL1.all                    = 0x0004;      // Main ADC C configuration

    // bit 15-14     00:     reserved
    // bit 13        0:      ADCBSY, ADC busy, read-only
    // bit 12        0:      reserved
    // bit 11-8      0's:    ADCBSYCHN, ADC busy channel, read-only
    // bit 7         0:      ADCPWDNZ, ADC power down, 0=powered down, 1=powered up
    // bit 6-3       0000:   reserved
    // bit 2         1:      INTPULSEPOS, INT pulse generation, 0=start of conversion, 1=end of conversion
    // bit 1-0       00:     reserved

    // ------ Configuring ADC A, ADC C Control-1 Register: END -------

    // ------ Configuring ADC A, ADC C Control-2 Register: START ------

