inceptor-101/TYPE2_AC_CHARGER/f280013x_adc2.c
    AdcaRegs.ADCCTL2.all                    = 0x0006;      // ADC A clock configuration (Set to 30MHz)
    AdccRegs.ADCCTL2.all                    = 0x0006;      // ADC C clock configuration (Set to 30MHz)

    // bit 15-8      0's:    reserved
    // bit 7         0:      reserved
    // bit 6         0:      reserved
    // bit 5-4       00:     reserved
    // bit 3-0       0110:   PRESCALE, ADC clock prescaler.  0110=CPUCLK/4 = 120MHz/4 = 30MHz

    // ------- Configuring ADC A, ADC C Control-2 Register: END -------

    // ------ Configuring ADC A, ADC C Burst Control Register (ADCBURSTCTL): START ------
    // ------ Since we are dealing with only one soc we need not care about the burst control or anything like that;

    AdcaRegs.ADCBURSTCTL.all                = 0x0000;
    AdccRegs.ADCBURSTCTL.all                = 0x0000;

    // bit 15        0:      BURSTEN, 0=burst mode disabled, 1=burst mode enabled
    // bit 14-12     000:    reserved
    // bit 11-8      0000:   BURSTSIZE, 0=1 SOC converted (don't care)
    // bit 7-6       00:     reserved
    // bit 5-0       000000: BURSTTRIGSEL, 00=software only (don't care)

    // ------- Configuring ADC A, ADC C Burst Control Register (ADCBURSTCTL): END -------


    asm(" EDIS");                               // Disable EALLOW protected register access

    // --------  Set Vref as Internal with 0 to 3.3V Range: START ----------

    SetVREF(ADC_ADCA, ADC_INTERNAL, ADC_VREF3P3);
    SetVREF(ADC_ADCC, ADC_INTERNAL, ADC_VREF3P3);

    // --------  Set Vref as Internal with 0 to 3.3V Range: END ----------
    // Pin 4 - ADC A6, CT signal for zero export control - GPIO228 (AGPIO)
    // Pin 5 - ADC A3, DC Link Voltage Sensing - GPIO 242 (AGPIO)
    // Pin 6 - ADC A2, Grid Voltage Sensing - GPIO 224 (AGPIO)
    // Pin 7 - ADC C7, PV Voltage Sensing - AIO 233
    // Pin 8 - ADC A11, PV Side Inductor Core Temperature - AIO 237
    // Pin 9 - ADC C2, PV Side Inductor Copper Temperature - AIO 244
    // Pin 10- ADC A1, Grid Current - AIO 232
    // Pin 11- ADC C15, PV Current - AIO 231
    // Pin 14- ADC C1, Grid Side Inductor Copper Temperature - AIO 238
    // Pin 15- ADC C3, Residual Current Sensing - AIO 245
    // Pin 16- ADC C11, Grid Side Inductor Core Temperature - AIO 241
    // Pin 19- ADC A4, Heat Sink Temperature - AIO 225
// ################################################################################################
// -------------------   SOC Configure for the 4 ADC Groups (A, B, C, D)   ------------------------
// ################################################################################################

    asm(" EALLOW");                     // Enable EALLOW protected register access

    //----- SOC (SOC0, SOC1, SOC2...) Configuration for ADC A: START -----
    //----- We are trying to configure the trigger and desired start of conversion channel----
    AdcaRegs.ADCSOC0CTL.bit.TRIGSEL         = 0x11;    // Trigger by ePWM7 SOC A
    AdcaRegs.ADCSOC0CTL.bit.CHSEL           = 0x2;    // Convert channel ADC A1: Grid Current
    AdcaRegs.ADCSOC0CTL.bit.ACQPS           = 0x0B;    // Acquisition window (12 SYSCLK Cycles) i.e., 100ns

    AdcaRegs.ADCSOC1CTL.bit.TRIGSEL         = 0x11;    // Trigger by ePWM4 SOC A
    AdcaRegs.ADCSOC1CTL.bit.CHSEL           = 0x3;    // Convert channel ADC A2: Grid Voltage
    AdcaRegs.ADCSOC1CTL.bit.ACQPS           = 0x0B;    // Acquisition window (12 SYSCLK Cycles) i.e., 100ns
//
    AdcaRegs.ADCSOC2CTL.bit.TRIGSEL         = 0x11;    // Trigger by ePWM4 SOC A
    AdcaRegs.ADCSOC2CTL.bit.CHSEL           = 0x15;    // Convert channel ADC A3: DC Link Voltage
    AdcaRegs.ADCSOC2CTL.bit.ACQPS           = 0x0B;    // Acquisition window (12 SYSCLK Cycles) i.e., 100ns
//
    AdcaRegs.ADCSOC3CTL.bit.TRIGSEL         = 0x11;    // Trigger by ePWM4 SOC A
    AdcaRegs.ADCSOC3CTL.bit.CHSEL           = 0x1;    // Convert channel ADC A4: Heat Sink Temperature
    AdcaRegs.ADCSOC3CTL.bit.ACQPS           = 0x0B;    // Acquisition window (12 SYSCLK Cycles) i.e., 100ns
//
//    AdcaRegs.ADCSOC4CTL.bit.TRIGSEL         = 0x0B;    // Trigger by ePWM4 SOC A
//    AdcaRegs.ADCSOC4CTL.bit.CHSEL           = 0x06;    // Convert channel ADC A6: CT for ZEC
//    AdcaRegs.ADCSOC4CTL.bit.ACQPS           = 0x0B;    // Acquisition window (12 SYSCLK Cycles) i.e., 100ns
//
//    AdcaRegs.ADCSOC5CTL.bit.TRIGSEL         = 0x0B;    // Trigger by ePWM4 SOC A
//    AdcaRegs.ADCSOC5CTL.bit.CHSEL           = 0x0B;    // Convert channel ADC A11: PV Inductor Core Temperature
//    AdcaRegs.ADCSOC5CTL.bit.ACQPS           = 0x0B;    // Acquisition window (12 SYSCLK Cycles) i.e., 100ns

//----- SOC (SOC0, SOC1, SOC2...) Configuration for ADC A: END -----

//----- SOC (SOC0, SOC1, SOC2...) Configuration for ADC C: START -----

    AdccRegs.ADCSOC0CTL.bit.TRIGSEL         = 0x11;    // Trigger by ePWM4 SOC A
    AdccRegs.ADCSOC0CTL.bit.CHSEL           = 0x3;    // Convert channel ADC C15: PV Current
    AdccRegs.ADCSOC0CTL.bit.ACQPS           = 0x0B;    // Acquisition window (12 SYSCLK Cycles) i.e., 100ns
//
    AdccRegs.ADCSOC1CTL.bit.TRIGSEL         = 0x11;    // Trigger by ePWM4 SOC A
    AdccRegs.ADCSOC1CTL.bit.CHSEL           = 0x6;    // Convert channel ADC C7: PV Voltage
    AdccRegs.ADCSOC1CTL.bit.ACQPS           = 0x0B;    // Acquisition window (12 SYSCLK Cycles) i.e., 100ns
//
    AdccRegs.ADCSOC2CTL.bit.TRIGSEL         = 0x11;    // Trigger by ePWM4 SOC A
    AdccRegs.ADCSOC2CTL.bit.CHSEL           = 0x0;    // Convert channel ADC C1: Grid Inductor Copper Temperature
    AdccRegs.ADCSOC2CTL.bit.ACQPS           = 0x0B;    // Acquisition window (12 SYSCLK Cycles) i.e., 100ns
//
//    AdccRegs.ADCSOC3CTL.bit.TRIGSEL         = 0x0B;    // Trigger by ePWM4 SOC A
//    AdccRegs.ADCSOC3CTL.bit.CHSEL           = 0x02;    // Convert channel ADC C2: PV Inductor copper temperature
//    AdccRegs.ADCSOC3CTL.bit.ACQPS           = 0x0B;    // Acquisition window (12 SYSCLK Cycles) i.e., 100ns
//
//    AdccRegs.ADCSOC4CTL.bit.TRIGSEL         = 0x0B;    // Trigger by ePWM4 SOC A
//    AdccRegs.ADCSOC4CTL.bit.CHSEL           = 0x03;    // Convert channel ADC C3: Residual Current Sensing
//    AdccRegs.ADCSOC4CTL.bit.ACQPS           = 0x0B;    // Acquisition window (12 SYSCLK Cycles) i.e., 100ns
//
//    AdccRegs.ADCSOC5CTL.bit.TRIGSEL         = 0x0B;    // Trigger by ePWM4 SOC A
//    AdccRegs.ADCSOC5CTL.bit.CHSEL           = 0x0B;    // Convert channel ADC C11: Grid Inductor Core Temperature
//    AdccRegs.ADCSOC5CTL.bit.ACQPS           = 0x0B;    // Acquisition window (12 SYSCLK Cycles) i.e., 100ns


//----- SOC (SOC0, SOC1, SOC2...) Configuration for ADC C: END -----


// ################################################################################################
// ----------------------------   Triggring the ADC Interrupts   ---------------------------------
// ################################################################################################

    //----- Triggering ADC Interrupts: START -----

