inceptor-101/TYPE2_AC_CHARGER/f280013x_adc2.c
//    AdcaRegs.ADCINTSOCSEL1.bit.SOC0         = 0;                // No ADCINT will trigger SOC0
//    AdcaRegs.ADCINTSOCSEL1.bit.SOC1         = 0;                // No ADCINT will trigger SOC1
//    AdcaRegs.ADCINTSOCSEL1.bit.SOC2         = 0;                // No ADCINT will trigger SOC2
//    AdcaRegs.ADCINTSOCSEL1.bit.SOC3         = 0;                // No ADCINT will trigger SOC3
//    AdcaRegs.ADCINTSOCSEL1.bit.SOC4         = 0;                // No ADCINT will trigger SOC4
//    AdcaRegs.ADCINTSOCSEL1.bit.SOC5         = 0;                // No ADCINT will trigger SOC5
//
//    AdccRegs.ADCINTSOCSEL1.bit.SOC0         = 0;                // No ADCINT will trigger SOC0
//    AdccRegs.ADCINTSOCSEL1.bit.SOC1         = 0;                // No ADCINT will trigger SOC1
//    AdccRegs.ADCINTSOCSEL1.bit.SOC2         = 0;                // No ADCINT will trigger SOC2
//    AdccRegs.ADCINTSOCSEL1.bit.SOC3         = 0;                // No ADCINT will trigger SOC3
//    AdccRegs.ADCINTSOCSEL1.bit.SOC4         = 0;                // No ADCINT will trigger SOC4
//    AdccRegs.ADCINTSOCSEL1.bit.SOC5         = 0;                // No ADCINT will trigger SOC5
//
    //----- Triggering ADC Interrupts: END -----

// ################################################################################################
// --------------------------------   SOC Priority Selection   ------------------------------------
// ################################################################################################

    //----- SOC Priority Selection for ADC SOC Channels: START -----
//
//    AdcaRegs.ADCSOCPRICTL.bit.SOCPRIORITY   = 0;  // SOC priority mode
//    AdccRegs.ADCSOCPRICTL.bit.SOCPRIORITY   = 0;  // SOC priority mode

    //----- SOC Priority Selection for ADC SOC Channels: END -----

// ################################################################################################
// ------------------------------   ADC Interrupt Configuration   ---------------------------------
// ################################################################################################

    //----- Configuring ADC A Interrupt-1 and disable ADC C interrupts  : START -----

     AdcaRegs.ADCINTSEL1N2.bit.INT1CONT      = 1;     // Interrupt pulses
     AdcaRegs.ADCINTSEL1N2.bit.INT1E         = 1;     // ADC A interrupt enable
     AdcaRegs.ADCINTSEL1N2.bit.INT1SEL       = 3;     // EOC5 triggers the interrupt

//
     AdccRegs.ADCINTSEL1N2.bit.INT1E         = 0;     // ADC C interrupt disable
//
//    //----- Configuring ADC A Interrupt-1 and disable ADC C interrupts  : END -----
//
//
//     //--- Allocating Comparator 1 to ADC A1 (grid current) ---
//     AnalogSubsysRegs.CMPHPMXSEL.bit.CMP1HPMXSEL = 4;
//     AnalogSubsysRegs.CMPLPMXSEL.bit.CMP1LPMXSEL = 4;
//
//     //--- Allocating Comparator 3 to ADC C15 (PV current) ---
//     AnalogSubsysRegs.CMPHPMXSEL.bit.CMP3HPMXSEL = 2;
//     AnalogSubsysRegs.CMPLPMXSEL.bit.CMP3LPMXSEL = 2;


     //******* Comparator Subsystem 1: Setting for hardware trip (grid current) : START ********

//     Cmpss1Regs.COMPCTL.bit.COMPHSOURCE      = 0;    // negative pin of high comparator is driven by internal DAC
//     Cmpss1Regs.COMPCTL.bit.COMPLSOURCE      = 0;    // negative pin of low comparator is driven by internal DAC
//
//     Cmpss1Regs.COMPCTL.bit.COMPHINV         = 0;    // output of comparator is not inverted
//     Cmpss1Regs.COMPCTL.bit.COMPLINV         = 1;    // output of low comparator is inverted
//
//     Cmpss1Regs.COMPCTL.bit.CTRIPHSEL        = 2;    // CTRIPH = Output of digital filter
//     Cmpss1Regs.COMPCTL.bit.CTRIPLSEL        = 2;    // CTRIPL = Output of digital filter
//
//     Cmpss1Regs.COMPCTL.bit.ASYNCHEN         = 0;    // don't care
//     Cmpss1Regs.COMPCTL.bit.ASYNCLEN         = 0;    // don't care
//
//     Cmpss1Regs.COMPHYSCTL.bit.COMPHYS       = 1;    // typical hysteresis set for comparator
//
//     Cmpss1Regs.COMPDACHCTL.bit.DACSOURCE    = 0;    // DACVALA = DACVALS
//     Cmpss1Regs.COMPDACHCTL.bit.SWLOADSEL    = 0;    // DACVALA updated every SYSCLK Cycle
//
//     Cmpss1Regs.DACHVALS.bit.DACVAL          = 2155;   // Trip voltage set at 1.7357V
//     Cmpss1Regs.DACLVALS.bit.DACVAL          = 1569;   // Trip voltage set at 1.2643V
//
//     Cmpss1Regs.CTRIPHFILCTL.bit.SAMPWIN     = 8;    // Sampling Window  = 9
//     Cmpss1Regs.CTRIPHFILCTL.bit.THRESH      = 5;    // At least 6 samples required for change in output
//     Cmpss1Regs.CTRIPHFILCTL.bit.FILINIT     = 1;    // initialize the FIFO
//
//     Cmpss1Regs.CTRIPHFILCLKCTL              = 5;    // samples to be taken at xx ns sampling time
//
//     Cmpss1Regs.CTRIPLFILCTL.bit.SAMPWIN     = 8;    // Sampling Window  = 9
//     Cmpss1Regs.CTRIPLFILCTL.bit.THRESH      = 5;    // At least 5 samples required for change in output
//     Cmpss1Regs.CTRIPLFILCTL.bit.FILINIT     = 1;    // initialize the FIFO
//
//     Cmpss1Regs.CTRIPLFILCLKCTL              = 5;    // samples to be taken at xx ns sampling time
//
//     Cmpss1Regs.COMPCTL.bit.COMPDACE         = 1;    // enable comparator 1

     // ******* Comparator Subsystem 1: Setting for hardware trip (Grid Current) : END ********

     // ******* Comparator Subsystem 3: Setting for hardware trip (PV Current) : START ********

//     CmpssLite3Regs.COMPCTL.bit.COMPHSOURCE  = 0;    // negative pin of high comparator is driven by internal DAC
//     CmpssLite3Regs.COMPCTL.bit.COMPLSOURCE  = 0;    // negative pin of low comparator is driven by internal DAC
//
//     CmpssLite3Regs.COMPCTL.bit.COMPHINV     = 0;    // output of comparator is not inverted
//     CmpssLite3Regs.COMPCTL.bit.COMPLINV     = 1;    // output of low comparator is inverted
//
//     CmpssLite3Regs.COMPCTL.bit.CTRIPHSEL        = 2;    // CTRIPH = Output of digital filter
//     CmpssLite3Regs.COMPCTL.bit.CTRIPLSEL        = 2;    // CTRIPL = Output of digital filter
//
//     CmpssLite3Regs.COMPCTL.bit.ASYNCHEN         = 0;    // don't care
//     CmpssLite3Regs.COMPCTL.bit.ASYNCLEN         = 0;    // don't care
//
//     CmpssLite3Regs.COMPHYSCTL.bit.COMPHYS       = 1;    // typical hysteresis set for comparator
//
//     CmpssLite3Regs.COMPDACHCTL.bit.SWLOADSEL     = 0;    // DACVALA updated every SYSCLK Cycle
//
//     CmpssLite3Regs.DACHVALS.bit.DACVAL          = 2155;   // Trip voltage set at 1.7357V
//     CmpssLite3Regs.DACLVALS.bit.DACVAL          = 1569;   // Trip voltage set at 1.2643V
//
//     CmpssLite3Regs.CTRIPHFILCTL.bit.SAMPWIN     = 8;    // Sampling Window  = 32
//     CmpssLite3Regs.CTRIPHFILCTL.bit.THRESH      = 5;    // At least 5 samples required for change in output
//     CmpssLite3Regs.CTRIPHFILCTL.bit.FILINIT     = 1;    // initialize the FIFO
//     CmpssLite3Regs.CTRIPHFILCLKCTL              = 5; // samples to be taken at xx ns sampling time
//
//     CmpssLite3Regs.CTRIPLFILCTL.bit.SAMPWIN     = 8;    // Sampling Window  = 9
//     CmpssLite3Regs.CTRIPLFILCTL.bit.THRESH      = 5;    // At least 5 samples required for change in output
//     CmpssLite3Regs.CTRIPLFILCTL.bit.FILINIT     = 1;    // initialize the FIFO
//
//     CmpssLite3Regs.CTRIPLFILCLKCTL              = 5; // samples to be taken at xx ns sampling time
//
//     CmpssLite3Regs.COMPCTL.bit.COMPDACE         = 1;    // enable comparator 3

     // ******* Comparator Subsystem 3: Setting for hardware trip (PV Current) : END ********

// ################################################################################################
// ----------------------------------------   Power UP the ADCs --------------------------------
// ################################################################################################

      //******** Powering Up ADCs : START *******

      AdcaRegs.ADCCTL1.bit.ADCPWDNZ           = 1;          // Power up the ADC A
      AdccRegs.ADCCTL1.bit.ADCPWDNZ           = 1;          // Power up the ADC C

      //******** Powering Up ADCs : END *******

      //******** Waiting Period after Power-Up the ADCs : START *******

      DELAY_US(1000);                              // Wait 1 ms after power-up before using the ADC

      //******** Waiting Period after Power-Up the ADCs : END *******

        asm(" EDIS");                               // Disable EALLOW protected register access

}

//
// End of File
//
